In [2]:
import numpy as np
import pandas as pd

In [3]:
#seed the random number generator
np.random.seed(42) 
#why do we often use 42 as the parameter here? 
#See https://www.kaggle.com/questions-and-answers/180377

Create a dataframe named df by using the DataFrame method in pandas.

In [4]:
df = pd.DataFrame(np.random.randint(0, 10, (3, 4)), index = [0, 1, 2],
                  columns=['A', 'B', 'C', 'D'])

Do the following in order and show the contents of the dataframe after each step:
1. show the contents of the dataframe
2. add a column named E with the values 7  4   3
3. add a column F where each row has the sum of the values from columns A and B
4. drop column D -- be sure that the dataframe no longer has this column
5. add a row with index 3 with all values of 0
6. give three ways of printing out the value of the element in the row with index 1 and column B

In [5]:
df

   A  B  C  D
0  6  3  7  4
1  6  9  2  6
2  7  4  3  7

In [7]:
df['E'] = [7,4,3]
df

   A  B  C  D  E
0  6  3  7  4  7
1  6  9  2  6  4
2  7  4  3  7  3

In [9]:
df['F'] = df['A'] + df["B"]
df

   A  B  C  D  E   F
0  6  3  7  4  7   9
1  6  9  2  6  4  15
2  7  4  3  7  3  11

In [11]:
df = df.drop("D", axis = 1)
df

   A  B  C  E   F
0  6  3  7  7   9
1  6  9  2  4  15
2  7  4  3  3  11

In [13]:
df.loc[len(df.index)] = [0, 0, 0,0,0]
df

   A  B  C  E   F
0  6  3  7  7   9
1  6  9  2  4  15
2  7  4  3  3  11
3  0  0  0  0   0

In [17]:
df['B'][1]

9

In [28]:
df.loc[1,"B"]

9

In [30]:
df.iloc[1,1]

9